# GetGridSegmentReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedSurface..::..GetGridSegmentReference Method
DividedSurface Class See Also
---
Get a reference to a line segment connecting two adjacent grid nodes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Reference GetGridSegmentReference(
	GridNode gridNode,
	GridSegmentDirection gridSegmentDirection
)
```

Visual Basic
---
```text
Public Function GetGridSegmentReference ( _
	gridNode As GridNode, _
	gridSegmentDirection As GridSegmentDirection _
) As Reference
```

Visual C++
---
```text
public:
Reference^ GetGridSegmentReference(
	GridNode gridNode,
	GridSegmentDirection gridSegmentDirection
)
```

# ### Parameters
gridNode
    Type: Autodesk.Revit.DB..::..GridNode
gridSegmentDirection
    Type: Autodesk.Revit.DB..::..GridSegmentDirection
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when the grid node indexes are outside the range [ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ], or when the adjacent grid node specified by gridSegmentDirection is out of range. |

# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace